# Belajar pandas

## #01: Menyertakan prefix dan suffix pada kolom data frame

In [35]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.3.3
1.21.2

In [36]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  8  9  2  5
1  3  4  8  9  8
2  7  5  1  5  5
3  6  9  8  9  5
4  4  7  7  4  5

In [37]:
tuple('ABCDE')

('A', 'B', 'C', 'D', 'E')

In [38]:
# Menyertakan prefix kolom
df.add_prefix('kolom_')

   kolom_A  kolom_B  kolom_C  kolom_D  kolom_E
0        9        8        9        2        5
1        3        4        8        9        8
2        7        5        1        5        5
3        6        9        8        9        5
4        4        7        7        4        5

In [39]:
#Menyertakan sufix kolom
df.add_suffix('_field')

   A_field  B_field  C_field  D_field  E_field
0        9        8        9        2        5
1        3        4        8        9        8
2        7        5        1        5        5
3        6        9        8        9        5
4        4        7        7        4        5

## #02: Pemilihan baris (rows selection) pada data frame

In [40]:
# Persiapan data frame
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,5, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  2  4  3  1  4
1  1  4  4  4  1
2  1  1  4  2  3
3  4  3  1  4  2
4  4  2  1  2  3
5  2  2  1  2  4
6  4  1  3  4  1
7  2  3  2  4  1
8  2  4  3  4  2
9  3  1  4  4  3

In [41]:
# Selection dengan operator logika | (or)
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  1  4  4  4  1
2  1  1  4  2  3
9  3  1  4  4  3

In [42]:
# Selection dengan fungsi isin()
df[df['A'].isin([1,3])]

   A  B  C  D  E
1  1  4  4  4  1
2  1  1  4  2  3
9  3  1  4  4  3

In [43]:
# Mengenal operator negasi ~
df[~df['A'].isin([1,3])]

   A  B  C  D  E
0  2  4  3  1  4
3  4  3  1  4  2
4  4  2  1  2  3
5  2  2  1  2  4
6  4  1  3  4  1
7  2  3  2  4  1
8  2  4  3  4  2

## #03: Konversi tipe data string ke numerik pada kolom data frame

In [44]:
# Persiapan data frame
data = {'col1':['1','2','3','teks'],
        'col2':['1','2','3','4']}

df=pd.DataFrame(data)
df

   col1 col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [45]:
df.dtypes

col1    object
col2    object
dtype: object

In [46]:
# konversi tipe data dengan fungsi astype()
df_x = df.astype({'col2':'int64'})
df_x

   col1  col2
0     1     1
1     2     2
2     3     3
3  teks     4

In [47]:
df_x.dtypes

col1    object
col2     int64
dtype: object

In [48]:
# Konversi tipe data numerik dengan fungsi to_numeric()
df.apply(pd.to_numeric, errors ='coerce')

   col1  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

## #04: Pemiliihan kolom (columns selection) pada pandas data frame berdasarkan tipe data

In [49]:
# Persiapan data frame
n_rows = 5
n_cols = 2
cols = ['bil_pecahan','bil_bulat']

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows, n_cols)), columns=cols)
df['bil_pecahan']=df['bil_pecahan'].astype('float')

df.index=pd.util.testing.makeDateIndex(n_rows, freq='H')
df=df.reset_index()

df['teks']=list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2000-01-01 00:00:00          6.0         14    A
1 2000-01-01 01:00:00          2.0          5    B
2 2000-01-01 02:00:00          4.0          4    C
3 2000-01-01 03:00:00          6.0          6    D
4 2000-01-01 04:00:00         18.0          5    E

In [50]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [51]:
# memilih kolom bertipe data numerik
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          6.0         14
1          2.0          5
2          4.0          4
3          6.0          6
4         18.0          5

In [52]:
df.select_dtypes(include='float')

   bil_pecahan
0          6.0
1          2.0
2          4.0
3          6.0
4         18.0

In [53]:
df.select_dtypes(include='int')

   bil_bulat
0         14
1          5
2          4
3          6
4          5

In [54]:
# Memilih kolom bertipe data string atau object
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [55]:
# Memilih kolom bertipe data datetime
df.select_dtypes(include='datetime')

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [56]:
# Memiliih kolom dengan kombinasi tipe data
df.select_dtypes(include=['number','object'])

   bil_pecahan  bil_bulat teks
0          6.0         14    A
1          2.0          5    B
2          4.0          4    C
3          6.0          6    D
4         18.0          5    E

## #05: Membalik urutan baris dan kolom pada data frame

In [57]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  1  9  5  7  2
1  2  2  3  2  4
2  8  5  5  5  7
3  7  5  2  9  1
4  5  4  5  4  1

In [58]:
# Membalik urutan kolom
df.loc[:, ::-1]

   E  D  C  B  A
0  2  7  5  9  1
1  4  2  3  2  2
2  7  5  5  5  8
3  1  9  2  5  7
4  1  4  5  4  5

In [59]:
# Membalik urutan baris
df.loc[::-1]

   A  B  C  D  E
4  5  4  5  4  1
3  7  5  2  9  1
2  8  5  5  5  7
1  2  2  3  2  4
0  1  9  5  7  2

In [60]:
# Membalik urutan baris dan melakukan penyesuaian ulang index
df.loc[::-1].reset_index(drop=True)

   A  B  C  D  E
0  5  4  5  4  1
1  7  5  2  9  1
2  8  5  5  5  7
3  2  2  3  2  4
4  1  9  5  7  2

## #06: Mengganti nama (label0 kolom pada data frame

In [61]:
# Persiapan data frame
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,10,size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  5  3  3  5  9
1  2  6  2  8  2
2  2  8  8  6  9
3  9  9  3  3  9
4  5  3  4  6  9

In [62]:
# Mengganti nama (label) untuk sebuah kolom pada data frame
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  5  3     3  5  9
1  2  6     2  8  2
2  2  8     8  6  9
3  9  9     3  3  9
4  5  3     4  6  9

In [63]:
# Mengganti nama (label) untuk banyak kolom pada data frame
df.rename(columns={'A':'Nama', 'B':'Alamat', 'D':'Kota'})

   Nama  Alamat  C  Kota  E
0     5       3  3     5  9
1     2       6  2     8  2
2     2       8  8     6  9
3     9       9  3     3  9
4     5       3  4     6  9

## #07: Menghapus missing values pada data frame (NaN)

In [66]:
# Persiapan data frame
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  UfUYO6bqqX -0.690782 -3.474277  0.641546       NaN
1  2sD68AgTMD -0.158210 -1.904085 -0.882871 -0.037172
2  pPTwUY6YRh -0.592244 -0.470952 -1.049571 -0.064053
3  VzkjNCvcuW -0.630955 -0.973919  0.804718  1.132630
4  lax9QKVEla       NaN -0.038887 -0.304816  0.612429

In [67]:
df = df.rename(columns={'index' : 'Z'})
df.head()

            Z         A         B         C         D
0  UfUYO6bqqX -0.690782 -3.474277  0.641546       NaN
1  2sD68AgTMD -0.158210 -1.904085 -0.882871 -0.037172
2  pPTwUY6YRh -0.592244 -0.470952 -1.049571 -0.064053
3  VzkjNCvcuW -0.630955 -0.973919  0.804718  1.132630
4  lax9QKVEla       NaN -0.038887 -0.304816  0.612429

In [68]:
df_backup = df.copy(deep=True)

In [69]:
# Menghapus (drop) setiap kolom yang mengandung missing values
df = df.dropna(axis='columns')
df.head()

            Z
0  UfUYO6bqqX
1  2sD68AgTMD
2  pPTwUY6YRh
3  VzkjNCvcuW
4  lax9QKVEla

In [70]:
# Menghapus (drop) setiap baris yang mengandung missing values
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
1  2sD68AgTMD -0.158210 -1.904085 -0.882871 -0.037172
2  pPTwUY6YRh -0.592244 -0.470952 -1.049571 -0.064053
3  VzkjNCvcuW -0.630955 -0.973919  0.804718  1.132630
5  gMa3CzokiC  0.242604  0.624052  0.265411  1.873331
7  C9VJgfZpc9  0.224701  0.953572 -0.220416 -0.283642